app/views/posts/index.html.erb

  </div>
    <% post.comments.reverse.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]