app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.new(comment_params)
    @comment.user = @current_user #NEED THIS TO SAVE CURRENT_USER to print out current user on posts and comments

    if @comment.save #saves model to database, returns boolean to show if post is saved or not.
      redirect_to posts_path + "##{@comment.id}" #links to the new comment that was made
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("text", "post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "kjhkjhjk"], ["post_id", 14], ["user_id", 15], ["created_at", "2016-03-22 17:34:44.102024"], ["updated_at", "2016-03-22 17:34:44.102024"]]