app/controllers/posts_controller.rb

INSERT INTO "posts" ("color", "title", "text", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["color", "orange"], ["title", "ASDa"], ["text", "asd"], ["user_id", 11], ["created_at", "2016-03-22 13:35:41.900423"], ["updated_at", "2016-03-22 13:35:41.900423"]]
---
  def create #need this to create new posts
    #@post = Post.new(params[:post]) #params gets attributes and maps them to the database, but this will give error because we need "strong parameters", so use the line inside private. Then use line below
    @post = Post.new(post_params)

    if @post.save #saves model to database, returns boolean to show if post is saved or not.
    redirect_to posts_path

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "posts" SET "color" = $1, "title" = $2, "text" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["color", "blue"], ["title", "Blue line be like"], ["text", "I'm not coming for another 28 minutes!"], ["updated_at", "2016-03-24 02:54:09.894239"], ["id", 15]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)