app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password") VALUES ($1, $2) RETURNING "id"  [["username", "maureen"], ["password", "vogel"]]
---
  def create
    @user = User.create(user_params)